* Programming interviews exposed

  It is a book \cite{mongan07} geared towards the introductory parts
  of a software interview. It is considered by many commenters

** Cyclic list detection

Write a function that takes a pointer to the head of a list and
determines whether the list is cyclic or acyclic. Your function should
return false if the list is acyclic and true if it is cyclic. You may
not modify the list in any way.

*** Design

#+BEGIN_QUOTE
What can you do with two pointers that you couldn’t do with one? You
can advance them on top of each other, but then you might as well have
one pointer. You could advance them with a fixed interval between
them, but this doesn’t seem to gain anything. What happens if you
advance the pointers at different speeds?

In the acyclic list, the faster pointer will reach the end. In the
cyclic list, they will both loop endlessly. The faster pointer will
eventually catch up with and pass the slower pointer. If the fast
pointer ever passes the slower pointer, you have a cyclic list. If it
encounters a NULL pointer, you have an acyclic list. \cite{mongan07}
#+END_QUOTE

The point of this problem, as most of the linked list problems
everywhere, is to check the candidate's skills with pointers.

The reason this is here is to illustrate how *adding* a new element
sometimes subtracts from the complexity of the solution. As an
addendum, the code in the book is bugged. A fixed version is found
below at [[src:cyclic-list-C]].

*** Solution

     #+CAPTION: Cyclic list detection, C version
     #+NAME: src|c|cyclic-list
     #+BEGIN_SRC C
       typedef struct Node {
         struct Node *next;
         int value;
       } Node;

       /* Takes a pointer to the head of a linked list and determines if
        ,* the list ends in a cycle or is NULL terminated
        ,*/
       bool determineTermination( Node *head ){
         Node *fast, *slow;
         fast = slow = head;
         while( true ){
           if( !fast || !fast->next ){
             return false;
           }
           slow = slow->next;
           fast = fast->next->next;
           if( fast == slow || fast->next == slow ){
             return true;
           }
         }
       }
     #+END_SRC

     #+NAME: src|c|cyclic-list-test
     #+BEGIN_SRC C :noweb yes :includes '(<stdbool.h> <stdio.h> <stdlib.h>) :exports none
       <<src|c|cyclic-list>>

       Node *head    = (Node*)malloc(sizeof(Node));
       Node *middle  = (Node*)malloc(sizeof(Node));
       Node *last    = (Node*)malloc(sizeof(Node));
       head->value   = 1;
       head->next    = middle;
       middle->value = 3;
       middle->next  = last;
       last->value   = 5;
       last->next    = head;
       printf("%d\n", determineTermination(head));
     #+END_SRC

     #+NAME: src|c|acyclic-list-test
     #+BEGIN_SRC C :noweb yes :includes '(<stdbool.h> <stdio.h> <stdlib.h>) :exports none
       <<src|c|cyclic-list>>

       Node *head    = (Node*)malloc(sizeof(Node));
       Node *middle  = (Node*)malloc(sizeof(Node));
       Node *last    = (Node*)malloc(sizeof(Node));
       head->value   = 1;
       head->next    = middle;
       middle->value = 3;
       middle->next  = last;
       last->value   = 5;
       last->next    = NULL;
       printf("%d\n", determineTermination(head));
     #+END_SRC

     #+CAPTION: Cyclic List Detection Test Table
     #+NAME: tbl:cyclic-list-test-table
     #+ATTR_LATEX: :align |l|l|l|
     | input   | expected | result |
     |---------+----------+--------|
     | cyclic  |        1 |      1 |
     | acyclic |        0 |      0 |
     #+TBLFM: @2$3='(org-sbe "src|c|cyclic-list-test")::@3$3='(org-sbe "src|c|acyclic-list-test")

** Trees (Preorder Traversal)

   One interesting bit extracted from the book pertains equivocations:

   #+BEGIN_QUOTE
   People often say /tree/ when they mean /binary search tree/. \cite{mongan07}
   #+END_QUOTE

   So, a general note could be: always try to understand the
   definitions used, if any.

*** Design

   Trees spells recursion, specially when dealing with traversal.

*** Implementation

    #+CAPTION: Reorder Traversal, OCaml version (including test)
    #+NAME: src|ocaml|reorder-traversal
    #+BEGIN_SRC ocaml
      type 'a binary_tree =
          | Empty
          | Node of 'a * 'a binary_tree * 'a binary_tree

      let rec reorder_traversal tree =
        match tree with
        | Node(head, Empty, Empty) -> [head]
        | Node(head, left, Empty)  -> head::(reorder_traversal left)
        | Node(head, Empty, right) -> head::(reorder_traversal right)
        | Node(head, left, right)  -> head::(List.append
                                               (reorder_traversal left)
                                               (reorder_traversal right))
        | Empty                    -> []

      let example_tree =
        Node(100,
             Node(50,
                  Node(25, Empty, Empty),
                  Node(75, Empty, Empty)),
             Node(150,
                  Empty,
                  Node(125,
                       Node(110, Empty, Empty),
                       Node(175, Empty, Empty))))

    #+END_SRC

    #+NAME: src|ocaml|reorder-traversal-caller
    #+BEGIN_SRC ocaml :noweb yes :exports none
      <<src|ocaml|reorder-traversal>>;;
      reorder_traversal example_tree;;
    #+END_SRC

    #+CAPTION: Reorder Traversal (Ocaml typed expressions)
    #+BEGIN_TABLE
    #+LATEX: \makebox[\textwidth][c]{
    #+ATTR_LATEX: :align |l|l|l|l|l|l|l|
    | expected                                             | result                                               |
    |------------------------------------------------------+------------------------------------------------------|
    | - : int list = [100; 50; 25; 75; 150; 125; 110; 175] | - : int list = [100; 50; 25; 75; 150; 125; 110; 175] |
    #+TBLFM: @2$2='(org-sbe "src|ocaml|reorder-traversal-caller")
    #+LATEX: }
    #+END_TABLE
